# IsImageCropped

## Description
Check is the given image cropped.

```pascal
FUNCTION IsImageCropped(object : HANDLE) : BOOLEAN;
```

```python

def vs.IsImageCropped(object):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE||

## Returns
Returns true if the given image is cropped, FALSE otherwise.

## Version
Availability: from Vectorworks 2014
## Category
* Textures